In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./test.csv')
df

   c1   c2         c3
0  CA   CA  christian
1  FL  NaN       mike
2  FL   FL  christian
3  CA   FL       mike
4  GA   MI  christian
5  WA   FL       mike

In [4]:
stacked = df[{'c1','c2'}].stack().astype('category')
result = stacked.cat.codes.unstack()
print(result)
print(df)
df['c1'] = result['c1'] + 1
df['c2'] = result['c2'] + 1
df

    c2   c1
0  0.0  0.0
1  NaN  1.0
2  1.0  1.0
3  1.0  0.0
4  3.0  2.0
5  1.0  4.0
    c1   c2         c3
0  0.0  0.0  christian
1  1.0  NaN       mike
2  1.0  1.0  christian
3  0.0  1.0       mike
4  2.0  3.0  christian
5  4.0  1.0       mike

    c1   c2         c3
0  1.0  1.0  christian
1  2.0  NaN       mike
2  2.0  2.0  christian
3  1.0  2.0       mike
4  3.0  4.0  christian
5  5.0  2.0       mike